grevaillot/svd_tools/headers/STM32H7x5_CM4/otg1_hs_device.h
#pragma once 

/* --- OTG1_HS_DEVICE: USB 1 on the go high speed ------------------- */

/** @defgroup otg1_hs_device_registers USB 1 on the go high speed Register
@{*/

/** OTG1_HS_DEVICE_OTG_HS_DCFG OTG_HS device configuration register **/
#define OTG1_HS_DEVICE_OTG_HS_DCFG			MMIO32(OTG1_HS_DEVICE_BASE + 0x00)
/** OTG1_HS_DEVICE_OTG_HS_DCTL OTG_HS device control register **/
#define OTG1_HS_DEVICE_OTG_HS_DCTL			MMIO32(OTG1_HS_DEVICE_BASE + 0x04)
/** OTG1_HS_DEVICE_OTG_HS_DSTS OTG_HS device status register **/
#define OTG1_HS_DEVICE_OTG_HS_DSTS			MMIO32(OTG1_HS_DEVICE_BASE + 0x08)
/** OTG1_HS_DEVICE_OTG_HS_DIEPMSK OTG_HS device IN endpoint common interrupt mask register **/
#define OTG1_HS_DEVICE_OTG_HS_DIEPMSK			MMIO32(OTG1_HS_DEVICE_BASE + 0x10)
/** OTG1_HS_DEVICE_OTG_HS_DOEPMSK OTG_HS device OUT endpoint common interrupt mask register **/
#define OTG1_HS_DEVICE_OTG_HS_DOEPMSK			MMIO32(OTG1_HS_DEVICE_BASE + 0x14)
/** OTG1_HS_DEVICE_OTG_HS_DAINT OTG_HS device all endpoints interrupt register **/
#define OTG1_HS_DEVICE_OTG_HS_DAINT			MMIO32(OTG1_HS_DEVICE_BASE + 0x18)
/** OTG1_HS_DEVICE_OTG_HS_DAINTMSK OTG_HS all endpoints interrupt mask register **/
#define OTG1_HS_DEVICE_OTG_HS_DAINTMSK			MMIO32(OTG1_HS_DEVICE_BASE + 0x1c)
/** OTG1_HS_DEVICE_OTG_HS_DVBUSDIS OTG_HS device VBUS discharge time register **/
#define OTG1_HS_DEVICE_OTG_HS_DVBUSDIS			MMIO32(OTG1_HS_DEVICE_BASE + 0x28)
/** OTG1_HS_DEVICE_OTG_HS_DVBUSPULSE OTG_HS device VBUS pulsing time register **/
#define OTG1_HS_DEVICE_OTG_HS_DVBUSPULSE			MMIO32(OTG1_HS_DEVICE_BASE + 0x2c)
/** OTG1_HS_DEVICE_OTG_HS_DTHRCTL OTG_HS Device threshold control register **/
#define OTG1_HS_DEVICE_OTG_HS_DTHRCTL			MMIO32(OTG1_HS_DEVICE_BASE + 0x30)
/** OTG1_HS_DEVICE_OTG_HS_DIEPEMPMSK OTG_HS device IN endpoint FIFO empty interrupt mask register **/
#define OTG1_HS_DEVICE_OTG_HS_DIEPEMPMSK			MMIO32(OTG1_HS_DEVICE_BASE + 0x34)
/** OTG1_HS_DEVICE_OTG_HS_DEACHINT OTG_HS device each endpoint interrupt register **/
#define OTG1_HS_DEVICE_OTG_HS_DEACHINT			MMIO32(OTG1_HS_DEVICE_BASE + 0x38)
/** OTG1_HS_DEVICE_OTG_HS_DEACHINTMSK OTG_HS device each endpoint interrupt register mask **/
#define OTG1_HS_DEVICE_OTG_HS_DEACHINTMSK			MMIO32(OTG1_HS_DEVICE_BASE + 0x3c)
/** OTG1_HS_DEVICE_OTG_HS_DIEPCTL0 OTG device endpoint-0 control register **/
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL0			MMIO32(OTG1_HS_DEVICE_BASE + 0x100)
/** OTG1_HS_DEVICE_OTG_HS_DIEPINT0 OTG device endpoint-0 interrupt register **/
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT0			MMIO32(OTG1_HS_DEVICE_BASE + 0x108)
/** OTG1_HS_DEVICE_OTG_HS_DIEPTSIZ0 OTG_HS device IN endpoint 0 transfer size register **/
#define OTG1_HS_DEVICE_OTG_HS_DIEPTSIZ0			MMIO32(OTG1_HS_DEVICE_BASE + 0x110)
/** OTG1_HS_DEVICE_OTG_HS_DIEPDMA1 OTG_HS device endpoint-1 DMA address register **/
#define OTG1_HS_DEVICE_OTG_HS_DIEPDMA1			MMIO32(OTG1_HS_DEVICE_BASE + 0x114)
/** OTG1_HS_DEVICE_OTG_HS_DTXFSTS0 OTG_HS device IN endpoint transmit FIFO status register **/
#define OTG1_HS_DEVICE_OTG_HS_DTXFSTS0			MMIO32(OTG1_HS_DEVICE_BASE + 0x118)
/** OTG1_HS_DEVICE_OTG_HS_DIEPCTL1 OTG device endpoint-1 control register **/
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL1			MMIO32(OTG1_HS_DEVICE_BASE + 0x120)
/** OTG1_HS_DEVICE_OTG_HS_DIEPINT1 OTG device endpoint-1 interrupt register **/
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT1			MMIO32(OTG1_HS_DEVICE_BASE + 0x128)
/** OTG1_HS_DEVICE_OTG_HS_DIEPTSIZ1 OTG_HS device endpoint transfer size register **/
#define OTG1_HS_DEVICE_OTG_HS_DIEPTSIZ1			MMIO32(OTG1_HS_DEVICE_BASE + 0x130)
/** OTG1_HS_DEVICE_OTG_HS_DIEPDMA2 OTG_HS device endpoint-2 DMA address register **/
#define OTG1_HS_DEVICE_OTG_HS_DIEPDMA2			MMIO32(OTG1_HS_DEVICE_BASE + 0x134)
/** OTG1_HS_DEVICE_OTG_HS_DTXFSTS1 OTG_HS device IN endpoint transmit FIFO status register **/
#define OTG1_HS_DEVICE_OTG_HS_DTXFSTS1			MMIO32(OTG1_HS_DEVICE_BASE + 0x138)
/** OTG1_HS_DEVICE_OTG_HS_DIEPCTL2 OTG device endpoint-2 control register **/
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL2			MMIO32(OTG1_HS_DEVICE_BASE + 0x140)
/** OTG1_HS_DEVICE_OTG_HS_DIEPINT2 OTG device endpoint-2 interrupt register **/
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT2			MMIO32(OTG1_HS_DEVICE_BASE + 0x148)
/** OTG1_HS_DEVICE_OTG_HS_DIEPTSIZ2 OTG_HS device endpoint transfer size register **/
#define OTG1_HS_DEVICE_OTG_HS_DIEPTSIZ2			MMIO32(OTG1_HS_DEVICE_BASE + 0x150)
/** OTG1_HS_DEVICE_OTG_HS_DIEPDMA3 OTG_HS device endpoint-3 DMA address register **/
#define OTG1_HS_DEVICE_OTG_HS_DIEPDMA3			MMIO32(OTG1_HS_DEVICE_BASE + 0x154)
/** OTG1_HS_DEVICE_OTG_HS_DTXFSTS2 OTG_HS device IN endpoint transmit FIFO status register **/
#define OTG1_HS_DEVICE_OTG_HS_DTXFSTS2			MMIO32(OTG1_HS_DEVICE_BASE + 0x158)
/** OTG1_HS_DEVICE_OTG_HS_DIEPCTL3 OTG device endpoint-3 control register **/
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL3			MMIO32(OTG1_HS_DEVICE_BASE + 0x160)
/** OTG1_HS_DEVICE_OTG_HS_DIEPINT3 OTG device endpoint-3 interrupt register **/
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT3			MMIO32(OTG1_HS_DEVICE_BASE + 0x168)
/** OTG1_HS_DEVICE_OTG_HS_DIEPTSIZ3 OTG_HS device endpoint transfer size register **/
#define OTG1_HS_DEVICE_OTG_HS_DIEPTSIZ3			MMIO32(OTG1_HS_DEVICE_BASE + 0x170)
/** OTG1_HS_DEVICE_OTG_HS_DIEPDMA4 OTG_HS device endpoint-4 DMA address register **/
#define OTG1_HS_DEVICE_OTG_HS_DIEPDMA4			MMIO32(OTG1_HS_DEVICE_BASE + 0x174)
/** OTG1_HS_DEVICE_OTG_HS_DTXFSTS3 OTG_HS device IN endpoint transmit FIFO status register **/
#define OTG1_HS_DEVICE_OTG_HS_DTXFSTS3			MMIO32(OTG1_HS_DEVICE_BASE + 0x178)
/** OTG1_HS_DEVICE_OTG_HS_DIEPCTL4 OTG device endpoint-4 control register **/
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL4			MMIO32(OTG1_HS_DEVICE_BASE + 0x180)
/** OTG1_HS_DEVICE_OTG_HS_DIEPINT4 OTG device endpoint-4 interrupt register **/
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT4			MMIO32(OTG1_HS_DEVICE_BASE + 0x188)
/** OTG1_HS_DEVICE_OTG_HS_DIEPTSIZ4 OTG_HS device endpoint transfer size register **/
#define OTG1_HS_DEVICE_OTG_HS_DIEPTSIZ4			MMIO32(OTG1_HS_DEVICE_BASE + 0x190)
/** OTG1_HS_DEVICE_OTG_HS_DIEPDMA5 OTG_HS device endpoint-5 DMA address register **/
#define OTG1_HS_DEVICE_OTG_HS_DIEPDMA5			MMIO32(OTG1_HS_DEVICE_BASE + 0x194)
/** OTG1_HS_DEVICE_OTG_HS_DTXFSTS4 OTG_HS device IN endpoint transmit FIFO status register **/
#define OTG1_HS_DEVICE_OTG_HS_DTXFSTS4			MMIO32(OTG1_HS_DEVICE_BASE + 0x198)
/** OTG1_HS_DEVICE_OTG_HS_DIEPCTL5 OTG device endpoint-5 control register **/
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL5			MMIO32(OTG1_HS_DEVICE_BASE + 0x1a0)
/** OTG1_HS_DEVICE_OTG_HS_DIEPTSIZ6 OTG_HS device endpoint transfer size register **/
#define OTG1_HS_DEVICE_OTG_HS_DIEPTSIZ6			MMIO32(OTG1_HS_DEVICE_BASE + 0x1a0)
/** OTG1_HS_DEVICE_OTG_HS_DTXFSTS6 OTG_HS device IN endpoint transmit FIFO status register **/
#define OTG1_HS_DEVICE_OTG_HS_DTXFSTS6			MMIO32(OTG1_HS_DEVICE_BASE + 0x1a4)
/** OTG1_HS_DEVICE_OTG_HS_DIEPINT5 OTG device endpoint-5 interrupt register **/
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT5			MMIO32(OTG1_HS_DEVICE_BASE + 0x1a8)
/** OTG1_HS_DEVICE_OTG_HS_DIEPTSIZ7 OTG_HS device endpoint transfer size register **/
#define OTG1_HS_DEVICE_OTG_HS_DIEPTSIZ7			MMIO32(OTG1_HS_DEVICE_BASE + 0x1a8)
/** OTG1_HS_DEVICE_OTG_HS_DTXFSTS7 OTG_HS device IN endpoint transmit FIFO status register **/
#define OTG1_HS_DEVICE_OTG_HS_DTXFSTS7			MMIO32(OTG1_HS_DEVICE_BASE + 0x1ac)
/** OTG1_HS_DEVICE_OTG_HS_DIEPTSIZ5 OTG_HS device endpoint transfer size register **/
#define OTG1_HS_DEVICE_OTG_HS_DIEPTSIZ5			MMIO32(OTG1_HS_DEVICE_BASE + 0x1b0)
/** OTG1_HS_DEVICE_OTG_HS_DTXFSTS5 OTG_HS device IN endpoint transmit FIFO status register **/
#define OTG1_HS_DEVICE_OTG_HS_DTXFSTS5			MMIO32(OTG1_HS_DEVICE_BASE + 0x1b8)
/** OTG1_HS_DEVICE_OTG_HS_DIEPCTL6 OTG device endpoint-6 control register **/
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL6			MMIO32(OTG1_HS_DEVICE_BASE + 0x1c0)
/** OTG1_HS_DEVICE_OTG_HS_DIEPINT6 OTG device endpoint-6 interrupt register **/
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT6			MMIO32(OTG1_HS_DEVICE_BASE + 0x1c8)
/** OTG1_HS_DEVICE_OTG_HS_DIEPCTL7 OTG device endpoint-7 control register **/
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL7			MMIO32(OTG1_HS_DEVICE_BASE + 0x1e0)
/** OTG1_HS_DEVICE_OTG_HS_DIEPINT7 OTG device endpoint-7 interrupt register **/
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT7			MMIO32(OTG1_HS_DEVICE_BASE + 0x1e8)
/** OTG1_HS_DEVICE_OTG_HS_DOEPCTL0 OTG_HS device control OUT endpoint 0 control register **/
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL0			MMIO32(OTG1_HS_DEVICE_BASE + 0x300)
/** OTG1_HS_DEVICE_OTG_HS_DOEPINT0 OTG_HS device endpoint-0 interrupt register **/
#define OTG1_HS_DEVICE_OTG_HS_DOEPINT0			MMIO32(OTG1_HS_DEVICE_BASE + 0x308)
/** OTG1_HS_DEVICE_OTG_HS_DOEPTSIZ0 OTG_HS device endpoint-0 transfer size register **/
#define OTG1_HS_DEVICE_OTG_HS_DOEPTSIZ0			MMIO32(OTG1_HS_DEVICE_BASE + 0x310)
/** OTG1_HS_DEVICE_OTG_HS_DOEPCTL1 OTG device endpoint-1 control register **/
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL1			MMIO32(OTG1_HS_DEVICE_BASE + 0x320)
/** OTG1_HS_DEVICE_OTG_HS_DOEPINT1 OTG_HS device endpoint-1 interrupt register **/
#define OTG1_HS_DEVICE_OTG_HS_DOEPINT1			MMIO32(OTG1_HS_DEVICE_BASE + 0x328)
/** OTG1_HS_DEVICE_OTG_HS_DOEPTSIZ1 OTG_HS device endpoint-1 transfer size register **/
#define OTG1_HS_DEVICE_OTG_HS_DOEPTSIZ1			MMIO32(OTG1_HS_DEVICE_BASE + 0x330)
/** OTG1_HS_DEVICE_OTG_HS_DOEPCTL2 OTG device endpoint-2 control register **/
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL2			MMIO32(OTG1_HS_DEVICE_BASE + 0x340)
/** OTG1_HS_DEVICE_OTG_HS_DOEPINT2 OTG_HS device endpoint-2 interrupt register **/
#define OTG1_HS_DEVICE_OTG_HS_DOEPINT2			MMIO32(OTG1_HS_DEVICE_BASE + 0x348)
/** OTG1_HS_DEVICE_OTG_HS_DOEPTSIZ2 OTG_HS device endpoint-2 transfer size register **/
#define OTG1_HS_DEVICE_OTG_HS_DOEPTSIZ2			MMIO32(OTG1_HS_DEVICE_BASE + 0x350)
/** OTG1_HS_DEVICE_OTG_HS_DOEPCTL3 OTG device endpoint-3 control register **/
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL3			MMIO32(OTG1_HS_DEVICE_BASE + 0x360)
/** OTG1_HS_DEVICE_OTG_HS_DOEPINT3 OTG_HS device endpoint-3 interrupt register **/
#define OTG1_HS_DEVICE_OTG_HS_DOEPINT3			MMIO32(OTG1_HS_DEVICE_BASE + 0x368)
/** OTG1_HS_DEVICE_OTG_HS_DOEPTSIZ3 OTG_HS device endpoint-3 transfer size register **/
#define OTG1_HS_DEVICE_OTG_HS_DOEPTSIZ3			MMIO32(OTG1_HS_DEVICE_BASE + 0x370)
/** OTG1_HS_DEVICE_OTG_HS_DOEPCTL4 OTG device endpoint-4 control register **/
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL4			MMIO32(OTG1_HS_DEVICE_BASE + 0x380)
/** OTG1_HS_DEVICE_OTG_HS_DOEPINT4 OTG_HS device endpoint-4 interrupt register **/
#define OTG1_HS_DEVICE_OTG_HS_DOEPINT4			MMIO32(OTG1_HS_DEVICE_BASE + 0x388)
/** OTG1_HS_DEVICE_OTG_HS_DOEPTSIZ4 OTG_HS device endpoint-4 transfer size register **/
#define OTG1_HS_DEVICE_OTG_HS_DOEPTSIZ4			MMIO32(OTG1_HS_DEVICE_BASE + 0x390)
/** OTG1_HS_DEVICE_OTG_HS_DOEPCTL5 OTG device endpoint-5 control register **/
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL5			MMIO32(OTG1_HS_DEVICE_BASE + 0x3a0)
/** OTG1_HS_DEVICE_OTG_HS_DOEPINT5 OTG_HS device endpoint-5 interrupt register **/
#define OTG1_HS_DEVICE_OTG_HS_DOEPINT5			MMIO32(OTG1_HS_DEVICE_BASE + 0x3a8)
/** OTG1_HS_DEVICE_OTG_HS_DOEPTSIZ5 OTG_HS device endpoint-5 transfer size register **/
#define OTG1_HS_DEVICE_OTG_HS_DOEPTSIZ5			MMIO32(OTG1_HS_DEVICE_BASE + 0x3b0)
/** OTG1_HS_DEVICE_OTG_HS_DOEPCTL6 OTG device endpoint-6 control register **/
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL6			MMIO32(OTG1_HS_DEVICE_BASE + 0x3c0)
/** OTG1_HS_DEVICE_OTG_HS_DOEPINT6 OTG_HS device endpoint-6 interrupt register **/
#define OTG1_HS_DEVICE_OTG_HS_DOEPINT6			MMIO32(OTG1_HS_DEVICE_BASE + 0x3c8)
/** OTG1_HS_DEVICE_OTG_HS_DOEPTSIZ6 OTG_HS device endpoint-6 transfer size register **/
#define OTG1_HS_DEVICE_OTG_HS_DOEPTSIZ6			MMIO32(OTG1_HS_DEVICE_BASE + 0x3d0)
/** OTG1_HS_DEVICE_OTG_HS_DOEPCTL7 OTG device endpoint-7 control register **/
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL7			MMIO32(OTG1_HS_DEVICE_BASE + 0x3e0)
/** OTG1_HS_DEVICE_OTG_HS_DOEPINT7 OTG_HS device endpoint-7 interrupt register **/
#define OTG1_HS_DEVICE_OTG_HS_DOEPINT7			MMIO32(OTG1_HS_DEVICE_BASE + 0x3e8)
/** OTG1_HS_DEVICE_OTG_HS_DOEPTSIZ7 OTG_HS device endpoint-7 transfer size register **/
#define OTG1_HS_DEVICE_OTG_HS_DOEPTSIZ7			MMIO32(OTG1_HS_DEVICE_BASE + 0x3f0)

/**@}*/


/** @defgroup otg1_hs_device_otg_hs_dcfg OTGHSDCFG OTG_HS device configuration register
@{*/


