grevaillot/svd_tools/headers/STM32H7x5_CM4/otg1_hs_device.h
#define OTG1_HS_DEVICE_OTG_HS_DCFG_PERSCHIVL_SHIFT		24
#define OTG1_HS_DEVICE_OTG_HS_DCFG_PERSCHIVL_MASK		0x03
/** @defgroup otg1_hs_device_otg_hs_dcfg_perschivl PERSCHIVL Periodic scheduling interval
@{*/
/**@}*/


#define OTG1_HS_DEVICE_OTG_HS_DCFG_PFIVL_SHIFT		11
#define OTG1_HS_DEVICE_OTG_HS_DCFG_PFIVL_MASK		0x03
/** @defgroup otg1_hs_device_otg_hs_dcfg_pfivl PFIVL Periodic (micro)frame interval
@{*/
/**@}*/


#define OTG1_HS_DEVICE_OTG_HS_DCFG_DAD_SHIFT		4
#define OTG1_HS_DEVICE_OTG_HS_DCFG_DAD_MASK		0x7f
/** @defgroup otg1_hs_device_otg_hs_dcfg_dad DAD Device address
@{*/
/**@}*/

/** OTG1_HS_DEVICE_OTG_HS_DCFG_NZLSOHSK Nonzero-length status OUT handshake **/
#define OTG1_HS_DEVICE_OTG_HS_DCFG_NZLSOHSK		(1 << 2)

#define OTG1_HS_DEVICE_OTG_HS_DCFG_DSPD_SHIFT		0
#define OTG1_HS_DEVICE_OTG_HS_DCFG_DSPD_MASK		0x03
/** @defgroup otg1_hs_device_otg_hs_dcfg_dspd DSPD Device speed
@{*/
/**@}*/


/**@}*/

/** @defgroup otg1_hs_device_otg_hs_dctl OTGHSDCTL OTG_HS device control register
@{*/

/** OTG1_HS_DEVICE_OTG_HS_DCTL_POPRGDNE Power-on programming done **/
#define OTG1_HS_DEVICE_OTG_HS_DCTL_POPRGDNE		(1 << 11)
/** OTG1_HS_DEVICE_OTG_HS_DCTL_CGONAK Clear global OUT NAK **/
#define OTG1_HS_DEVICE_OTG_HS_DCTL_CGONAK		(1 << 10)
/** OTG1_HS_DEVICE_OTG_HS_DCTL_SGONAK Set global OUT NAK **/
#define OTG1_HS_DEVICE_OTG_HS_DCTL_SGONAK		(1 << 9)
/** OTG1_HS_DEVICE_OTG_HS_DCTL_CGINAK Clear global IN NAK **/
#define OTG1_HS_DEVICE_OTG_HS_DCTL_CGINAK		(1 << 8)
/** OTG1_HS_DEVICE_OTG_HS_DCTL_SGINAK Set global IN NAK **/
#define OTG1_HS_DEVICE_OTG_HS_DCTL_SGINAK		(1 << 7)

#define OTG1_HS_DEVICE_OTG_HS_DCTL_TCTL_SHIFT		4
#define OTG1_HS_DEVICE_OTG_HS_DCTL_TCTL_MASK		0x07
/** @defgroup otg1_hs_device_otg_hs_dctl_tctl TCTL Test control
@{*/
/**@}*/

/** OTG1_HS_DEVICE_OTG_HS_DCTL_GONSTS Global OUT NAK status **/
#define OTG1_HS_DEVICE_OTG_HS_DCTL_GONSTS		(1 << 3)
/** OTG1_HS_DEVICE_OTG_HS_DCTL_GINSTS Global IN NAK status **/
#define OTG1_HS_DEVICE_OTG_HS_DCTL_GINSTS		(1 << 2)
/** OTG1_HS_DEVICE_OTG_HS_DCTL_SDIS Soft disconnect **/
#define OTG1_HS_DEVICE_OTG_HS_DCTL_SDIS		(1 << 1)
/** OTG1_HS_DEVICE_OTG_HS_DCTL_RWUSIG Remote wakeup signaling **/
#define OTG1_HS_DEVICE_OTG_HS_DCTL_RWUSIG		(1 << 0)

/**@}*/

/** @defgroup otg1_hs_device_otg_hs_dsts OTGHSDSTS OTG_HS device status register
@{*/


#define OTG1_HS_DEVICE_OTG_HS_DSTS_FNSOF_SHIFT		8
#define OTG1_HS_DEVICE_OTG_HS_DSTS_FNSOF_MASK		0x3fff
/** @defgroup otg1_hs_device_otg_hs_dsts_fnsof FNSOF Frame number of the received SOF
@{*/
/**@}*/

/** OTG1_HS_DEVICE_OTG_HS_DSTS_EERR Erratic error **/
#define OTG1_HS_DEVICE_OTG_HS_DSTS_EERR		(1 << 3)

#define OTG1_HS_DEVICE_OTG_HS_DSTS_ENUMSPD_SHIFT		1
#define OTG1_HS_DEVICE_OTG_HS_DSTS_ENUMSPD_MASK		0x03
/** @defgroup otg1_hs_device_otg_hs_dsts_enumspd ENUMSPD Enumerated speed
@{*/
/**@}*/

/** OTG1_HS_DEVICE_OTG_HS_DSTS_SUSPSTS Suspend status **/
#define OTG1_HS_DEVICE_OTG_HS_DSTS_SUSPSTS		(1 << 0)

/**@}*/

/** @defgroup otg1_hs_device_otg_hs_diepmsk OTGHSDIEPMSK OTG_HS device IN endpoint common interrupt mask register
@{*/

/** OTG1_HS_DEVICE_OTG_HS_DIEPMSK_BIM BNA interrupt mask **/
#define OTG1_HS_DEVICE_OTG_HS_DIEPMSK_BIM		(1 << 9)
/** OTG1_HS_DEVICE_OTG_HS_DIEPMSK_TXFURM FIFO underrun mask **/
#define OTG1_HS_DEVICE_OTG_HS_DIEPMSK_TXFURM		(1 << 8)
/** OTG1_HS_DEVICE_OTG_HS_DIEPMSK_INEPNEM IN endpoint NAK effective mask **/
#define OTG1_HS_DEVICE_OTG_HS_DIEPMSK_INEPNEM		(1 << 6)
/** OTG1_HS_DEVICE_OTG_HS_DIEPMSK_INEPNMM IN token received with EP mismatch mask **/
#define OTG1_HS_DEVICE_OTG_HS_DIEPMSK_INEPNMM		(1 << 5)
/** OTG1_HS_DEVICE_OTG_HS_DIEPMSK_ITTXFEMSK IN token received when TxFIFO empty mask **/
#define OTG1_HS_DEVICE_OTG_HS_DIEPMSK_ITTXFEMSK		(1 << 4)
/** OTG1_HS_DEVICE_OTG_HS_DIEPMSK_TOM Timeout condition mask (nonisochronous endpoints) **/
#define OTG1_HS_DEVICE_OTG_HS_DIEPMSK_TOM		(1 << 3)
/** OTG1_HS_DEVICE_OTG_HS_DIEPMSK_EPDM Endpoint disabled interrupt mask **/
#define OTG1_HS_DEVICE_OTG_HS_DIEPMSK_EPDM		(1 << 1)
/** OTG1_HS_DEVICE_OTG_HS_DIEPMSK_XFRCM Transfer completed interrupt mask **/
#define OTG1_HS_DEVICE_OTG_HS_DIEPMSK_XFRCM		(1 << 0)

/**@}*/

/** @defgroup otg1_hs_device_otg_hs_doepmsk OTGHSDOEPMSK OTG_HS device OUT endpoint common interrupt mask register
@{*/

/** OTG1_HS_DEVICE_OTG_HS_DOEPMSK_BOIM BNA interrupt mask **/
#define OTG1_HS_DEVICE_OTG_HS_DOEPMSK_BOIM		(1 << 9)
/** OTG1_HS_DEVICE_OTG_HS_DOEPMSK_OPEM OUT packet error mask **/
#define OTG1_HS_DEVICE_OTG_HS_DOEPMSK_OPEM		(1 << 8)
/** OTG1_HS_DEVICE_OTG_HS_DOEPMSK_B2BSTUP Back-to-back SETUP packets received mask **/
#define OTG1_HS_DEVICE_OTG_HS_DOEPMSK_B2BSTUP		(1 << 6)
/** OTG1_HS_DEVICE_OTG_HS_DOEPMSK_OTEPDM OUT token received when endpoint disabled mask **/
#define OTG1_HS_DEVICE_OTG_HS_DOEPMSK_OTEPDM		(1 << 4)
/** OTG1_HS_DEVICE_OTG_HS_DOEPMSK_STUPM SETUP phase done mask **/
#define OTG1_HS_DEVICE_OTG_HS_DOEPMSK_STUPM		(1 << 3)
/** OTG1_HS_DEVICE_OTG_HS_DOEPMSK_EPDM Endpoint disabled interrupt mask **/
#define OTG1_HS_DEVICE_OTG_HS_DOEPMSK_EPDM		(1 << 1)
/** OTG1_HS_DEVICE_OTG_HS_DOEPMSK_XFRCM Transfer completed interrupt mask **/
#define OTG1_HS_DEVICE_OTG_HS_DOEPMSK_XFRCM		(1 << 0)

/**@}*/

/** @defgroup otg1_hs_device_otg_hs_daint OTGHSDAINT OTG_HS device all endpoints interrupt register
@{*/


#define OTG1_HS_DEVICE_OTG_HS_DAINT_OEPINT_SHIFT		16
#define OTG1_HS_DEVICE_OTG_HS_DAINT_OEPINT_MASK		0xffff
/** @defgroup otg1_hs_device_otg_hs_daint_oepint OEPINT OUT endpoint interrupt bits
@{*/
/**@}*/


#define OTG1_HS_DEVICE_OTG_HS_DAINT_IEPINT_SHIFT		0
#define OTG1_HS_DEVICE_OTG_HS_DAINT_IEPINT_MASK		0xffff
/** @defgroup otg1_hs_device_otg_hs_daint_iepint IEPINT IN endpoint interrupt bits
@{*/
/**@}*/


/**@}*/

/** @defgroup otg1_hs_device_otg_hs_daintmsk OTGHSDAINTMSK OTG_HS all endpoints interrupt mask register
@{*/


#define OTG1_HS_DEVICE_OTG_HS_DAINTMSK_OEPM_SHIFT		16
#define OTG1_HS_DEVICE_OTG_HS_DAINTMSK_OEPM_MASK		0xffff
/** @defgroup otg1_hs_device_otg_hs_daintmsk_oepm OEPM OUT EP interrupt mask bits
@{*/
/**@}*/


#define OTG1_HS_DEVICE_OTG_HS_DAINTMSK_IEPM_SHIFT		0
#define OTG1_HS_DEVICE_OTG_HS_DAINTMSK_IEPM_MASK		0xffff
/** @defgroup otg1_hs_device_otg_hs_daintmsk_iepm IEPM IN EP interrupt mask bits
@{*/
/**@}*/


/**@}*/

