grevaillot/svd_tools/headers/STM32H7x5_CM4/otg1_hs_device.h
/** @defgroup otg1_hs_device_otg_hs_diepctl6 OTGHSDIEPCTL6 OTG device endpoint-6 control register
@{*/

/** OTG1_HS_DEVICE_OTG_HS_DIEPCTL6_EPENA Endpoint enable **/
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL6_EPENA		(1 << 31)
/** OTG1_HS_DEVICE_OTG_HS_DIEPCTL6_EPDIS Endpoint disable **/
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL6_EPDIS		(1 << 30)
/** OTG1_HS_DEVICE_OTG_HS_DIEPCTL6_SODDFRM Set odd frame **/
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL6_SODDFRM		(1 << 29)
/** OTG1_HS_DEVICE_OTG_HS_DIEPCTL6_SD0PID_SEVNFRM Set DATA0 PID **/
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL6_SD0PID_SEVNFRM		(1 << 28)
/** OTG1_HS_DEVICE_OTG_HS_DIEPCTL6_SNAK Set NAK **/
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL6_SNAK		(1 << 27)
/** OTG1_HS_DEVICE_OTG_HS_DIEPCTL6_CNAK Clear NAK **/
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL6_CNAK		(1 << 26)

#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL6_TXFNUM_SHIFT		22
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL6_TXFNUM_MASK		0x0f
/** @defgroup otg1_hs_device_otg_hs_diepctl6_txfnum TXFNUM TxFIFO number
@{*/
/**@}*/

/** OTG1_HS_DEVICE_OTG_HS_DIEPCTL6_Stall STALL handshake **/
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL6_Stall		(1 << 21)

#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL6_EPTYP_SHIFT		18
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL6_EPTYP_MASK		0x03
/** @defgroup otg1_hs_device_otg_hs_diepctl6_eptyp EPTYP Endpoint type
@{*/
/**@}*/

/** OTG1_HS_DEVICE_OTG_HS_DIEPCTL6_NAKSTS NAK status **/
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL6_NAKSTS		(1 << 17)
/** OTG1_HS_DEVICE_OTG_HS_DIEPCTL6_EONUM_DPID Even/odd frame **/
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL6_EONUM_DPID		(1 << 16)
/** OTG1_HS_DEVICE_OTG_HS_DIEPCTL6_USBAEP USB active endpoint **/
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL6_USBAEP		(1 << 15)

#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL6_MPSIZ_SHIFT		0
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL6_MPSIZ_MASK		0x7ff
/** @defgroup otg1_hs_device_otg_hs_diepctl6_mpsiz MPSIZ Maximum packet size
@{*/
/**@}*/


/**@}*/

/** @defgroup otg1_hs_device_otg_hs_diepint6 OTGHSDIEPINT6 OTG device endpoint-6 interrupt register
@{*/

/** OTG1_HS_DEVICE_OTG_HS_DIEPINT6_NAK NAK interrupt **/
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT6_NAK		(1 << 13)
/** OTG1_HS_DEVICE_OTG_HS_DIEPINT6_BERR Babble error interrupt **/
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT6_BERR		(1 << 12)
/** OTG1_HS_DEVICE_OTG_HS_DIEPINT6_PKTDRPSTS Packet dropped status **/
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT6_PKTDRPSTS		(1 << 11)
/** OTG1_HS_DEVICE_OTG_HS_DIEPINT6_BNA Buffer not available interrupt **/
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT6_BNA		(1 << 9)
/** OTG1_HS_DEVICE_OTG_HS_DIEPINT6_TXFIFOUDRN Transmit Fifo Underrun **/
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT6_TXFIFOUDRN		(1 << 8)
/** OTG1_HS_DEVICE_OTG_HS_DIEPINT6_TXFE Transmit FIFO empty **/
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT6_TXFE		(1 << 7)
/** OTG1_HS_DEVICE_OTG_HS_DIEPINT6_INEPNE IN endpoint NAK effective **/
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT6_INEPNE		(1 << 6)
/** OTG1_HS_DEVICE_OTG_HS_DIEPINT6_ITTXFE IN token received when TxFIFO is empty **/
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT6_ITTXFE		(1 << 4)
/** OTG1_HS_DEVICE_OTG_HS_DIEPINT6_TOC Timeout condition **/
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT6_TOC		(1 << 3)
/** OTG1_HS_DEVICE_OTG_HS_DIEPINT6_EPDISD Endpoint disabled interrupt **/
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT6_EPDISD		(1 << 1)
/** OTG1_HS_DEVICE_OTG_HS_DIEPINT6_XFRC Transfer completed interrupt **/
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT6_XFRC		(1 << 0)

/**@}*/

/** @defgroup otg1_hs_device_otg_hs_diepctl7 OTGHSDIEPCTL7 OTG device endpoint-7 control register
@{*/

/** OTG1_HS_DEVICE_OTG_HS_DIEPCTL7_EPENA Endpoint enable **/
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL7_EPENA		(1 << 31)
/** OTG1_HS_DEVICE_OTG_HS_DIEPCTL7_EPDIS Endpoint disable **/
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL7_EPDIS		(1 << 30)
/** OTG1_HS_DEVICE_OTG_HS_DIEPCTL7_SODDFRM Set odd frame **/
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL7_SODDFRM		(1 << 29)
/** OTG1_HS_DEVICE_OTG_HS_DIEPCTL7_SD0PID_SEVNFRM Set DATA0 PID **/
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL7_SD0PID_SEVNFRM		(1 << 28)
/** OTG1_HS_DEVICE_OTG_HS_DIEPCTL7_SNAK Set NAK **/
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL7_SNAK		(1 << 27)
/** OTG1_HS_DEVICE_OTG_HS_DIEPCTL7_CNAK Clear NAK **/
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL7_CNAK		(1 << 26)

#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL7_TXFNUM_SHIFT		22
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL7_TXFNUM_MASK		0x0f
/** @defgroup otg1_hs_device_otg_hs_diepctl7_txfnum TXFNUM TxFIFO number
@{*/
/**@}*/

/** OTG1_HS_DEVICE_OTG_HS_DIEPCTL7_Stall STALL handshake **/
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL7_Stall		(1 << 21)

#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL7_EPTYP_SHIFT		18
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL7_EPTYP_MASK		0x03
/** @defgroup otg1_hs_device_otg_hs_diepctl7_eptyp EPTYP Endpoint type
@{*/
/**@}*/

/** OTG1_HS_DEVICE_OTG_HS_DIEPCTL7_NAKSTS NAK status **/
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL7_NAKSTS		(1 << 17)
/** OTG1_HS_DEVICE_OTG_HS_DIEPCTL7_EONUM_DPID Even/odd frame **/
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL7_EONUM_DPID		(1 << 16)
/** OTG1_HS_DEVICE_OTG_HS_DIEPCTL7_USBAEP USB active endpoint **/
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL7_USBAEP		(1 << 15)

#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL7_MPSIZ_SHIFT		0
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL7_MPSIZ_MASK		0x7ff
/** @defgroup otg1_hs_device_otg_hs_diepctl7_mpsiz MPSIZ Maximum packet size
@{*/
/**@}*/


/**@}*/

/** @defgroup otg1_hs_device_otg_hs_diepint7 OTGHSDIEPINT7 OTG device endpoint-7 interrupt register
@{*/

/** OTG1_HS_DEVICE_OTG_HS_DIEPINT7_NAK NAK interrupt **/
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT7_NAK		(1 << 13)
/** OTG1_HS_DEVICE_OTG_HS_DIEPINT7_BERR Babble error interrupt **/
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT7_BERR		(1 << 12)
/** OTG1_HS_DEVICE_OTG_HS_DIEPINT7_PKTDRPSTS Packet dropped status **/
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT7_PKTDRPSTS		(1 << 11)
/** OTG1_HS_DEVICE_OTG_HS_DIEPINT7_BNA Buffer not available interrupt **/
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT7_BNA		(1 << 9)
/** OTG1_HS_DEVICE_OTG_HS_DIEPINT7_TXFIFOUDRN Transmit Fifo Underrun **/
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT7_TXFIFOUDRN		(1 << 8)
/** OTG1_HS_DEVICE_OTG_HS_DIEPINT7_TXFE Transmit FIFO empty **/
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT7_TXFE		(1 << 7)
/** OTG1_HS_DEVICE_OTG_HS_DIEPINT7_INEPNE IN endpoint NAK effective **/
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT7_INEPNE		(1 << 6)
/** OTG1_HS_DEVICE_OTG_HS_DIEPINT7_ITTXFE IN token received when TxFIFO is empty **/
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT7_ITTXFE		(1 << 4)
/** OTG1_HS_DEVICE_OTG_HS_DIEPINT7_TOC Timeout condition **/
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT7_TOC		(1 << 3)
/** OTG1_HS_DEVICE_OTG_HS_DIEPINT7_EPDISD Endpoint disabled interrupt **/
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT7_EPDISD		(1 << 1)
/** OTG1_HS_DEVICE_OTG_HS_DIEPINT7_XFRC Transfer completed interrupt **/
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT7_XFRC		(1 << 0)

/**@}*/

/** @defgroup otg1_hs_device_otg_hs_doepctl0 OTGHSDOEPCTL0 OTG_HS device control OUT endpoint 0 control register
@{*/

