grevaillot/svd_tools/headers/STM32H7x5_CM4/otg1_hs_device.h
/** OTG1_HS_DEVICE_OTG_HS_DOEPCTL0_EPENA Endpoint enable **/
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL0_EPENA		(1 << 31)
/** OTG1_HS_DEVICE_OTG_HS_DOEPCTL0_EPDIS Endpoint disable **/
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL0_EPDIS		(1 << 30)
/** OTG1_HS_DEVICE_OTG_HS_DOEPCTL0_SNAK Set NAK **/
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL0_SNAK		(1 << 27)
/** OTG1_HS_DEVICE_OTG_HS_DOEPCTL0_CNAK Clear NAK **/
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL0_CNAK		(1 << 26)
/** OTG1_HS_DEVICE_OTG_HS_DOEPCTL0_Stall STALL handshake **/
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL0_Stall		(1 << 21)
/** OTG1_HS_DEVICE_OTG_HS_DOEPCTL0_SNPM Snoop mode **/
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL0_SNPM		(1 << 20)

#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL0_EPTYP_SHIFT		18
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL0_EPTYP_MASK		0x03
/** @defgroup otg1_hs_device_otg_hs_doepctl0_eptyp EPTYP Endpoint type
@{*/
/**@}*/

/** OTG1_HS_DEVICE_OTG_HS_DOEPCTL0_NAKSTS NAK status **/
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL0_NAKSTS		(1 << 17)
/** OTG1_HS_DEVICE_OTG_HS_DOEPCTL0_USBAEP USB active endpoint **/
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL0_USBAEP		(1 << 15)

#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL0_MPSIZ_SHIFT		0
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL0_MPSIZ_MASK		0x03
/** @defgroup otg1_hs_device_otg_hs_doepctl0_mpsiz MPSIZ Maximum packet size
@{*/
/**@}*/


/**@}*/

/** @defgroup otg1_hs_device_otg_hs_doepint0 OTGHSDOEPINT0 OTG_HS device endpoint-0 interrupt register
@{*/

/** OTG1_HS_DEVICE_OTG_HS_DOEPINT0_NYET NYET interrupt **/
#define OTG1_HS_DEVICE_OTG_HS_DOEPINT0_NYET		(1 << 14)
/** OTG1_HS_DEVICE_OTG_HS_DOEPINT0_B2BSTUP Back-to-back SETUP packets received **/
#define OTG1_HS_DEVICE_OTG_HS_DOEPINT0_B2BSTUP		(1 << 6)
/** OTG1_HS_DEVICE_OTG_HS_DOEPINT0_OTEPDIS OUT token received when endpoint disabled **/
#define OTG1_HS_DEVICE_OTG_HS_DOEPINT0_OTEPDIS		(1 << 4)
/** OTG1_HS_DEVICE_OTG_HS_DOEPINT0_STUP SETUP phase done **/
#define OTG1_HS_DEVICE_OTG_HS_DOEPINT0_STUP		(1 << 3)
/** OTG1_HS_DEVICE_OTG_HS_DOEPINT0_EPDISD Endpoint disabled interrupt **/
#define OTG1_HS_DEVICE_OTG_HS_DOEPINT0_EPDISD		(1 << 1)
/** OTG1_HS_DEVICE_OTG_HS_DOEPINT0_XFRC Transfer completed interrupt **/
#define OTG1_HS_DEVICE_OTG_HS_DOEPINT0_XFRC		(1 << 0)

/**@}*/

/** @defgroup otg1_hs_device_otg_hs_doeptsiz0 OTGHSDOEPTSIZ0 OTG_HS device endpoint-0 transfer size register
@{*/


#define OTG1_HS_DEVICE_OTG_HS_DOEPTSIZ0_STUPCNT_SHIFT		29
#define OTG1_HS_DEVICE_OTG_HS_DOEPTSIZ0_STUPCNT_MASK		0x03
/** @defgroup otg1_hs_device_otg_hs_doeptsiz0_stupcnt STUPCNT SETUP packet count
@{*/
/**@}*/

/** OTG1_HS_DEVICE_OTG_HS_DOEPTSIZ0_PKTCNT Packet count **/
#define OTG1_HS_DEVICE_OTG_HS_DOEPTSIZ0_PKTCNT		(1 << 19)

#define OTG1_HS_DEVICE_OTG_HS_DOEPTSIZ0_XFRSIZ_SHIFT		0
#define OTG1_HS_DEVICE_OTG_HS_DOEPTSIZ0_XFRSIZ_MASK		0x7f
/** @defgroup otg1_hs_device_otg_hs_doeptsiz0_xfrsiz XFRSIZ Transfer size
@{*/
/**@}*/


/**@}*/

/** @defgroup otg1_hs_device_otg_hs_doepctl1 OTGHSDOEPCTL1 OTG device endpoint-1 control register
@{*/

/** OTG1_HS_DEVICE_OTG_HS_DOEPCTL1_EPENA Endpoint enable **/
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL1_EPENA		(1 << 31)
/** OTG1_HS_DEVICE_OTG_HS_DOEPCTL1_EPDIS Endpoint disable **/
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL1_EPDIS		(1 << 30)
/** OTG1_HS_DEVICE_OTG_HS_DOEPCTL1_SODDFRM Set odd frame **/
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL1_SODDFRM		(1 << 29)
/** OTG1_HS_DEVICE_OTG_HS_DOEPCTL1_SD0PID_SEVNFRM Set DATA0 PID/Set even frame **/
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL1_SD0PID_SEVNFRM		(1 << 28)
/** OTG1_HS_DEVICE_OTG_HS_DOEPCTL1_SNAK Set NAK **/
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL1_SNAK		(1 << 27)
/** OTG1_HS_DEVICE_OTG_HS_DOEPCTL1_CNAK Clear NAK **/
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL1_CNAK		(1 << 26)
/** OTG1_HS_DEVICE_OTG_HS_DOEPCTL1_Stall STALL handshake **/
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL1_Stall		(1 << 21)
/** OTG1_HS_DEVICE_OTG_HS_DOEPCTL1_SNPM Snoop mode **/
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL1_SNPM		(1 << 20)

#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL1_EPTYP_SHIFT		18
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL1_EPTYP_MASK		0x03
/** @defgroup otg1_hs_device_otg_hs_doepctl1_eptyp EPTYP Endpoint type
@{*/
/**@}*/

/** OTG1_HS_DEVICE_OTG_HS_DOEPCTL1_NAKSTS NAK status **/
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL1_NAKSTS		(1 << 17)
/** OTG1_HS_DEVICE_OTG_HS_DOEPCTL1_EONUM_DPID Even odd frame/Endpoint data PID **/
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL1_EONUM_DPID		(1 << 16)
/** OTG1_HS_DEVICE_OTG_HS_DOEPCTL1_USBAEP USB active endpoint **/
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL1_USBAEP		(1 << 15)

#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL1_MPSIZ_SHIFT		0
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL1_MPSIZ_MASK		0x7ff
/** @defgroup otg1_hs_device_otg_hs_doepctl1_mpsiz MPSIZ Maximum packet size
@{*/
/**@}*/


/**@}*/

/** @defgroup otg1_hs_device_otg_hs_doepint1 OTGHSDOEPINT1 OTG_HS device endpoint-1 interrupt register
@{*/

/** OTG1_HS_DEVICE_OTG_HS_DOEPINT1_NYET NYET interrupt **/
#define OTG1_HS_DEVICE_OTG_HS_DOEPINT1_NYET		(1 << 14)
/** OTG1_HS_DEVICE_OTG_HS_DOEPINT1_B2BSTUP Back-to-back SETUP packets received **/
#define OTG1_HS_DEVICE_OTG_HS_DOEPINT1_B2BSTUP		(1 << 6)
/** OTG1_HS_DEVICE_OTG_HS_DOEPINT1_OTEPDIS OUT token received when endpoint disabled **/
#define OTG1_HS_DEVICE_OTG_HS_DOEPINT1_OTEPDIS		(1 << 4)
/** OTG1_HS_DEVICE_OTG_HS_DOEPINT1_STUP SETUP phase done **/
#define OTG1_HS_DEVICE_OTG_HS_DOEPINT1_STUP		(1 << 3)
/** OTG1_HS_DEVICE_OTG_HS_DOEPINT1_EPDISD Endpoint disabled interrupt **/
#define OTG1_HS_DEVICE_OTG_HS_DOEPINT1_EPDISD		(1 << 1)
/** OTG1_HS_DEVICE_OTG_HS_DOEPINT1_XFRC Transfer completed interrupt **/
#define OTG1_HS_DEVICE_OTG_HS_DOEPINT1_XFRC		(1 << 0)

/**@}*/

/** @defgroup otg1_hs_device_otg_hs_doeptsiz1 OTGHSDOEPTSIZ1 OTG_HS device endpoint-1 transfer size register
@{*/


#define OTG1_HS_DEVICE_OTG_HS_DOEPTSIZ1_RXDPID_STUPCNT_SHIFT		29
#define OTG1_HS_DEVICE_OTG_HS_DOEPTSIZ1_RXDPID_STUPCNT_MASK		0x03
/** @defgroup otg1_hs_device_otg_hs_doeptsiz1_rxdpid_stupcnt RXDPIDSTUPCNT Received data PID/SETUP packet count
@{*/
/**@}*/


#define OTG1_HS_DEVICE_OTG_HS_DOEPTSIZ1_PKTCNT_SHIFT		19
#define OTG1_HS_DEVICE_OTG_HS_DOEPTSIZ1_PKTCNT_MASK		0x3ff
/** @defgroup otg1_hs_device_otg_hs_doeptsiz1_pktcnt PKTCNT Packet count
@{*/
/**@}*/


