grevaillot/svd_tools/headers/STM32H7x5_CM4/otg1_hs_device.h
#define OTG1_HS_DEVICE_OTG_HS_DOEPTSIZ1_XFRSIZ_SHIFT		0
#define OTG1_HS_DEVICE_OTG_HS_DOEPTSIZ1_XFRSIZ_MASK		0x7ffff
/** @defgroup otg1_hs_device_otg_hs_doeptsiz1_xfrsiz XFRSIZ Transfer size
@{*/
/**@}*/


/**@}*/

/** @defgroup otg1_hs_device_otg_hs_doepctl2 OTGHSDOEPCTL2 OTG device endpoint-2 control register
@{*/

/** OTG1_HS_DEVICE_OTG_HS_DOEPCTL2_EPENA Endpoint enable **/
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL2_EPENA		(1 << 31)
/** OTG1_HS_DEVICE_OTG_HS_DOEPCTL2_EPDIS Endpoint disable **/
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL2_EPDIS		(1 << 30)
/** OTG1_HS_DEVICE_OTG_HS_DOEPCTL2_SODDFRM Set odd frame **/
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL2_SODDFRM		(1 << 29)
/** OTG1_HS_DEVICE_OTG_HS_DOEPCTL2_SD0PID_SEVNFRM Set DATA0 PID/Set even frame **/
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL2_SD0PID_SEVNFRM		(1 << 28)
/** OTG1_HS_DEVICE_OTG_HS_DOEPCTL2_SNAK Set NAK **/
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL2_SNAK		(1 << 27)
/** OTG1_HS_DEVICE_OTG_HS_DOEPCTL2_CNAK Clear NAK **/
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL2_CNAK		(1 << 26)
/** OTG1_HS_DEVICE_OTG_HS_DOEPCTL2_Stall STALL handshake **/
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL2_Stall		(1 << 21)
/** OTG1_HS_DEVICE_OTG_HS_DOEPCTL2_SNPM Snoop mode **/
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL2_SNPM		(1 << 20)

#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL2_EPTYP_SHIFT		18
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL2_EPTYP_MASK		0x03
/** @defgroup otg1_hs_device_otg_hs_doepctl2_eptyp EPTYP Endpoint type
@{*/
/**@}*/

/** OTG1_HS_DEVICE_OTG_HS_DOEPCTL2_NAKSTS NAK status **/
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL2_NAKSTS		(1 << 17)
/** OTG1_HS_DEVICE_OTG_HS_DOEPCTL2_EONUM_DPID Even odd frame/Endpoint data PID **/
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL2_EONUM_DPID		(1 << 16)
/** OTG1_HS_DEVICE_OTG_HS_DOEPCTL2_USBAEP USB active endpoint **/
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL2_USBAEP		(1 << 15)

#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL2_MPSIZ_SHIFT		0
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL2_MPSIZ_MASK		0x7ff
/** @defgroup otg1_hs_device_otg_hs_doepctl2_mpsiz MPSIZ Maximum packet size
@{*/
/**@}*/


/**@}*/

/** @defgroup otg1_hs_device_otg_hs_doepint2 OTGHSDOEPINT2 OTG_HS device endpoint-2 interrupt register
@{*/

/** OTG1_HS_DEVICE_OTG_HS_DOEPINT2_NYET NYET interrupt **/
#define OTG1_HS_DEVICE_OTG_HS_DOEPINT2_NYET		(1 << 14)
/** OTG1_HS_DEVICE_OTG_HS_DOEPINT2_B2BSTUP Back-to-back SETUP packets received **/
#define OTG1_HS_DEVICE_OTG_HS_DOEPINT2_B2BSTUP		(1 << 6)
/** OTG1_HS_DEVICE_OTG_HS_DOEPINT2_OTEPDIS OUT token received when endpoint disabled **/
#define OTG1_HS_DEVICE_OTG_HS_DOEPINT2_OTEPDIS		(1 << 4)
/** OTG1_HS_DEVICE_OTG_HS_DOEPINT2_STUP SETUP phase done **/
#define OTG1_HS_DEVICE_OTG_HS_DOEPINT2_STUP		(1 << 3)
/** OTG1_HS_DEVICE_OTG_HS_DOEPINT2_EPDISD Endpoint disabled interrupt **/
#define OTG1_HS_DEVICE_OTG_HS_DOEPINT2_EPDISD		(1 << 1)
/** OTG1_HS_DEVICE_OTG_HS_DOEPINT2_XFRC Transfer completed interrupt **/
#define OTG1_HS_DEVICE_OTG_HS_DOEPINT2_XFRC		(1 << 0)

/**@}*/

/** @defgroup otg1_hs_device_otg_hs_doeptsiz2 OTGHSDOEPTSIZ2 OTG_HS device endpoint-2 transfer size register
@{*/


#define OTG1_HS_DEVICE_OTG_HS_DOEPTSIZ2_RXDPID_STUPCNT_SHIFT		29
#define OTG1_HS_DEVICE_OTG_HS_DOEPTSIZ2_RXDPID_STUPCNT_MASK		0x03
/** @defgroup otg1_hs_device_otg_hs_doeptsiz2_rxdpid_stupcnt RXDPIDSTUPCNT Received data PID/SETUP packet count
@{*/
/**@}*/


#define OTG1_HS_DEVICE_OTG_HS_DOEPTSIZ2_PKTCNT_SHIFT		19
#define OTG1_HS_DEVICE_OTG_HS_DOEPTSIZ2_PKTCNT_MASK		0x3ff
/** @defgroup otg1_hs_device_otg_hs_doeptsiz2_pktcnt PKTCNT Packet count
@{*/
/**@}*/


#define OTG1_HS_DEVICE_OTG_HS_DOEPTSIZ2_XFRSIZ_SHIFT		0
#define OTG1_HS_DEVICE_OTG_HS_DOEPTSIZ2_XFRSIZ_MASK		0x7ffff
/** @defgroup otg1_hs_device_otg_hs_doeptsiz2_xfrsiz XFRSIZ Transfer size
@{*/
/**@}*/


/**@}*/

/** @defgroup otg1_hs_device_otg_hs_doepctl3 OTGHSDOEPCTL3 OTG device endpoint-3 control register
@{*/

/** OTG1_HS_DEVICE_OTG_HS_DOEPCTL3_EPENA Endpoint enable **/
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL3_EPENA		(1 << 31)
/** OTG1_HS_DEVICE_OTG_HS_DOEPCTL3_EPDIS Endpoint disable **/
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL3_EPDIS		(1 << 30)
/** OTG1_HS_DEVICE_OTG_HS_DOEPCTL3_SODDFRM Set odd frame **/
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL3_SODDFRM		(1 << 29)
/** OTG1_HS_DEVICE_OTG_HS_DOEPCTL3_SD0PID_SEVNFRM Set DATA0 PID/Set even frame **/
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL3_SD0PID_SEVNFRM		(1 << 28)
/** OTG1_HS_DEVICE_OTG_HS_DOEPCTL3_SNAK Set NAK **/
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL3_SNAK		(1 << 27)
/** OTG1_HS_DEVICE_OTG_HS_DOEPCTL3_CNAK Clear NAK **/
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL3_CNAK		(1 << 26)
/** OTG1_HS_DEVICE_OTG_HS_DOEPCTL3_Stall STALL handshake **/
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL3_Stall		(1 << 21)
/** OTG1_HS_DEVICE_OTG_HS_DOEPCTL3_SNPM Snoop mode **/
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL3_SNPM		(1 << 20)

#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL3_EPTYP_SHIFT		18
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL3_EPTYP_MASK		0x03
/** @defgroup otg1_hs_device_otg_hs_doepctl3_eptyp EPTYP Endpoint type
@{*/
/**@}*/

/** OTG1_HS_DEVICE_OTG_HS_DOEPCTL3_NAKSTS NAK status **/
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL3_NAKSTS		(1 << 17)
/** OTG1_HS_DEVICE_OTG_HS_DOEPCTL3_EONUM_DPID Even odd frame/Endpoint data PID **/
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL3_EONUM_DPID		(1 << 16)
/** OTG1_HS_DEVICE_OTG_HS_DOEPCTL3_USBAEP USB active endpoint **/
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL3_USBAEP		(1 << 15)

#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL3_MPSIZ_SHIFT		0
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL3_MPSIZ_MASK		0x7ff
/** @defgroup otg1_hs_device_otg_hs_doepctl3_mpsiz MPSIZ Maximum packet size
@{*/
/**@}*/


/**@}*/

/** @defgroup otg1_hs_device_otg_hs_doepint3 OTGHSDOEPINT3 OTG_HS device endpoint-3 interrupt register
@{*/

/** OTG1_HS_DEVICE_OTG_HS_DOEPINT3_NYET NYET interrupt **/
#define OTG1_HS_DEVICE_OTG_HS_DOEPINT3_NYET		(1 << 14)
/** OTG1_HS_DEVICE_OTG_HS_DOEPINT3_B2BSTUP Back-to-back SETUP packets received **/
#define OTG1_HS_DEVICE_OTG_HS_DOEPINT3_B2BSTUP		(1 << 6)
/** OTG1_HS_DEVICE_OTG_HS_DOEPINT3_OTEPDIS OUT token received when endpoint disabled **/
#define OTG1_HS_DEVICE_OTG_HS_DOEPINT3_OTEPDIS		(1 << 4)
/** OTG1_HS_DEVICE_OTG_HS_DOEPINT3_STUP SETUP phase done **/
#define OTG1_HS_DEVICE_OTG_HS_DOEPINT3_STUP		(1 << 3)
/** OTG1_HS_DEVICE_OTG_HS_DOEPINT3_EPDISD Endpoint disabled interrupt **/
#define OTG1_HS_DEVICE_OTG_HS_DOEPINT3_EPDISD		(1 << 1)
/** OTG1_HS_DEVICE_OTG_HS_DOEPINT3_XFRC Transfer completed interrupt **/
#define OTG1_HS_DEVICE_OTG_HS_DOEPINT3_XFRC		(1 << 0)

/**@}*/

/** @defgroup otg1_hs_device_otg_hs_doeptsiz3 OTGHSDOEPTSIZ3 OTG_HS device endpoint-3 transfer size register
@{*/


#define OTG1_HS_DEVICE_OTG_HS_DOEPTSIZ3_RXDPID_STUPCNT_SHIFT		29
#define OTG1_HS_DEVICE_OTG_HS_DOEPTSIZ3_RXDPID_STUPCNT_MASK		0x03
/** @defgroup otg1_hs_device_otg_hs_doeptsiz3_rxdpid_stupcnt RXDPIDSTUPCNT Received data PID/SETUP packet count
@{*/
/**@}*/


#define OTG1_HS_DEVICE_OTG_HS_DOEPTSIZ3_PKTCNT_SHIFT		19
#define OTG1_HS_DEVICE_OTG_HS_DOEPTSIZ3_PKTCNT_MASK		0x3ff
/** @defgroup otg1_hs_device_otg_hs_doeptsiz3_pktcnt PKTCNT Packet count
@{*/
/**@}*/


#define OTG1_HS_DEVICE_OTG_HS_DOEPTSIZ3_XFRSIZ_SHIFT		0
#define OTG1_HS_DEVICE_OTG_HS_DOEPTSIZ3_XFRSIZ_MASK		0x7ffff
/** @defgroup otg1_hs_device_otg_hs_doeptsiz3_xfrsiz XFRSIZ Transfer size
@{*/
/**@}*/


/**@}*/

/** @defgroup otg1_hs_device_otg_hs_doepctl4 OTGHSDOEPCTL4 OTG device endpoint-4 control register
@{*/

/** OTG1_HS_DEVICE_OTG_HS_DOEPCTL4_EPENA Endpoint enable **/
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL4_EPENA		(1 << 31)
/** OTG1_HS_DEVICE_OTG_HS_DOEPCTL4_EPDIS Endpoint disable **/
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL4_EPDIS		(1 << 30)
/** OTG1_HS_DEVICE_OTG_HS_DOEPCTL4_SODDFRM Set odd frame **/
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL4_SODDFRM		(1 << 29)
/** OTG1_HS_DEVICE_OTG_HS_DOEPCTL4_SD0PID_SEVNFRM Set DATA0 PID/Set even frame **/
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL4_SD0PID_SEVNFRM		(1 << 28)
/** OTG1_HS_DEVICE_OTG_HS_DOEPCTL4_SNAK Set NAK **/
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL4_SNAK		(1 << 27)
/** OTG1_HS_DEVICE_OTG_HS_DOEPCTL4_CNAK Clear NAK **/
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL4_CNAK		(1 << 26)
/** OTG1_HS_DEVICE_OTG_HS_DOEPCTL4_Stall STALL handshake **/
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL4_Stall		(1 << 21)
/** OTG1_HS_DEVICE_OTG_HS_DOEPCTL4_SNPM Snoop mode **/
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL4_SNPM		(1 << 20)

#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL4_EPTYP_SHIFT		18
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL4_EPTYP_MASK		0x03
/** @defgroup otg1_hs_device_otg_hs_doepctl4_eptyp EPTYP Endpoint type
@{*/
/**@}*/

